#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/honestbank/terraform-gcp-gke/runs/run-vaoSJyeCAYJEpxZb

Waiting for the plan to start...

Terraform v1.1.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
random_id.run_id: Refreshing state... [id=zg-qjw]
module.gke.google_service_account.default: Refreshing state... [id=projects/test-terraform-project-01/serviceAccounts/gke-ce0faa8f-sa@test-terraform-project-01.iam.gserviceaccount.com]
module.gke.google_compute_router.router: Refreshing state... [id=projects/test-terraform-project-01/regions/asia-southeast2/routers/gke-ce0faa8f-router]
module.gke.google_compute_router_nat.nat: Refreshing state... [id=test-terraform-project-01/asia-southeast2/gke-ce0faa8f-router/gke-ce0faa8f-nat]
module.gke.google_container_cluster.primary: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-ce0faa8f]
module.gke.google_container_node_pool.primary_node_pool: Refreshing state... [id=projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-ce0faa8f/nodePools/primary]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.gke.data.google_container_cluster.current_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "google_container_cluster" "current_cluster"  {
      ~ addons_config                     = [
          - {
              - cloudrun_config                       = []
              - config_connector_config               = []
              - dns_cache_config                      = []
              - gce_persistent_disk_csi_driver_config = [
                  - {
                      - enabled = true
                    },
                ]
              - horizontal_pod_autoscaling            = [
                  - {
                      - disabled = false
                    },
                ]
              - http_load_balancing                   = [
                  - {
                      - disabled = false
                    },
                ]
              - istio_config                          = [
                  - {
                      - auth     = ""
                      - disabled = true
                    },
                ]
              - kalm_config                           = []
              - network_policy_config                 = [
                  - {
                      - disabled = false
                    },
                ]
            },
        ] -> (known after apply)
      ~ authenticator_groups_config       = [
          - {
              - security_group = "gke-security-groups@honestbank.com"
            },
        ] -> (known after apply)
      ~ cluster_autoscaling               = [
          - {
              - auto_provisioning_defaults = []
              - autoscaling_profile        = "BALANCED"
              - enabled                    = false
              - resource_limits            = []
            },
        ] -> (known after apply)
      ~ cluster_ipv4_cidr                 = "10.20.0.0/16" -> (known after apply)
      ~ cluster_telemetry                 = [
          - {
              - type = "ENABLED"
            },
        ] -> (known after apply)
      ~ confidential_nodes                = [] -> (known after apply)
      ~ database_encryption               = [
          - {
              - key_name = ""
              - state    = "DECRYPTED"
            },
        ] -> (known after apply)
      + datapath_provider                 = (known after apply)
      ~ default_max_pods_per_node         = 110 -> (known after apply)
      ~ default_snat_status               = [
          - {
              - disabled = false
            },
        ] -> (known after apply)
      + description                       = (known after apply)
      ~ dns_config                        = [] -> (known after apply)
      ~ enable_autopilot                  = false -> (known after apply)
      ~ enable_binary_authorization       = true -> (known after apply)
      ~ enable_intranode_visibility       = true -> (known after apply)
      ~ enable_kubernetes_alpha           = false -> (known after apply)
      ~ enable_l4_ilb_subsetting          = false -> (known after apply)
      ~ enable_legacy_abac                = false -> (known after apply)
      ~ enable_shielded_nodes             = true -> (known after apply)
      ~ enable_tpu                        = false -> (known after apply)
      ~ endpoint                          = "34.101.66.208" -> (known after apply)
      ~ id                                = "projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-ce0faa8f" -> (known after apply)
      ~ identity_service_config           = [] -> (known after apply)
      ~ initial_node_count                = 1 -> (known after apply)
      ~ ip_allocation_policy              = [
          - {
              - cluster_ipv4_cidr_block       = "10.20.0.0/16"
              - cluster_secondary_range_name  = "honestcard-compute-pods-subnet"
              - services_ipv4_cidr_block      = "10.30.0.0/16"
              - services_secondary_range_name = "honestcard-compute-services-subnet"
            },
        ] -> (known after apply)
      ~ label_fingerprint                 = "5f106aed" -> (known after apply)
      ~ logging_config                    = [
          - {
              - enable_components = [
                  - "SYSTEM_COMPONENTS",
                  - "WORKLOADS",
                ]
            },
        ] -> (known after apply)
      ~ logging_service                   = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ maintenance_policy                = [] -> (known after apply)
      ~ master_auth                       = [
          - {
              - client_certificate        = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSURvRENDQWdpZ0F3SUJBZ0lRQksyZ0F4d0ova211MVFXRjZodzVPREFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRNU9HWXdOamxpWXkxa05qUTRMVFJsT0RNdFlqazJaQzFoTmpVd1pUUTFabU5sWVdVdwpIaGNOTWpJd01qQTJNVEF4TXpReFdoY05NamN3TWpBMU1UQXhNelF4V2pBUk1ROHdEUVlEVlFRREV3WmpiR2xsCmJuUXdnZ0VpTUEwR0NTcUdTSWIzRFFFQkFRVUFBNElCRHdBd2dnRUtBb0lCQVFEYVFBcWF1QkdzTmViakxXWDgKUkZLR0lndU42Rk1abUJ4aU9xQ1VLc2ZuSmdrQzh4S0hkRmw2dldpV2FYdHQvemVrL3pXR1MxeENhdnpoQ29qOQpIQ3o2ckxPa2s0UjN0VDYzOTNNKzdxQXNiczVaZWROc3MxbEs2Q0Z6NmY4d2NZQmc3WFUvdDA4ODdrckwrY1pwClNIOXl5MU9yUEZwbk5XYmc1SzlyZlQ1NE5VV1FuRVJoQjJVSjlFb0w0a0t2aEhzRVR5WUEyRzJUdlUzc09jb0gKdUFDU0c0U1pPK2ttRWh2RE1Ob0JUYmFCWUEyMnhGY1NRYkpkWEJiWkk2Z1dVc25BbDAxSW9WVTF1eVRadHhEaApOcFo3TjR5Rk9na0dDVkUxdVVudFNTTkhtL0R2M3ErSjZhcWRqZEhrQkkwYnRod2MvTnY1bDRwam1uU2YrdnRnCjlWZURBZ01CQUFHalZqQlVNQTRHQTFVZER3RUIvd1FFQXdJRm9EQVRCZ05WSFNVRUREQUtCZ2dyQmdFRkJRY0QKQWpBTUJnTlZIUk1CQWY4RUFqQUFNQjhHQTFVZEl3UVlNQmFBRktlSTdtSnQ3b1BFd1dhY0UxSm43ak9CM1l0WgpNQTBHQ1NxR1NJYjNEUUVCQ3dVQUE0SUJnUUJWQlVydXE5R2tselVEV2tJRG1oeVZXT1ZNTVA4VDVtVlRyU1hkCllmWWdoa1BteW5YeDBHeFRFZUxUWHpWSVZ6RU1tRFJleHExck45OVl5VUtVZitkZnFSWWJGK2FoKzF5VkRVc1QKdUowSWFPUWJQMEE3N2tPWFQ0d0FCTmVnV0M2TUt5d3ZxNjZWWUJaYkJPL00xdlFtZnBQK3BZbUE1aGtTRDNhZgprckpQNkJ1NkZBYjFkckZNRjRjVTByVHFEaXZYWVJoK3VNK1ZBSzVCNVZ0QVhGRzkzd0NOQ3VYWFQ2b0J5d3lVCnlSeGRpYmhRSnJPZzloSVh1REtLVS9vekZhb0VyMW8vZGp6TDVqcDFjZnRHN3o0QjYyZmx2OU51dFQ5bUdUeXcKSXdsWFRJblBxUnlNMWVyL1Y1ajRiTlNYbmE3SEJqYkFIOUNUMzNpbUw0anlZNXU5S0ZQK2F6eGVyZkJXYTk4UApZVkVZQWhUbW42OWhEZ3dBcXU2WHlkYmRKV3JkMlJUditJS2FtbzU4L1M3SEJmMjRtazNsV3Q4NVVKQ1dMM1dDCjVWYnFLaVVJTUNsS1E5ZzNqVUZSZUhVMlRPZ1MxQ1RTSElQSVdJekxIeU9RUUxid0xoM3JjbkZVSWMwUGJ1VnkKTCtvbjRtbG9jTWc1UUx3TWlLRnpwUWxlR1VBPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_certificate_config = [
                  - {
                      - issue_client_certificate = true
                    },
                ]
              - client_key                = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlFb2dJQkFBS0NBUUVBMmtBS21yZ1JyRFhtNHkxbC9FUlNoaUlMamVoVEdaZ2NZanFnbENySDV5WUpBdk1TCmgzUlplcjFvbG1sN2JmODNwUDgxaGt0Y1Ftcjg0UXFJL1J3cytxeXpwSk9FZDdVK3QvZHpQdTZnTEc3T1dYblQKYkxOWlN1Z2hjK24vTUhHQVlPMTFQN2RQUE81S3kvbkdhVWgvY3N0VHF6eGFaelZtNE9TdmEzMCtlRFZGa0p4RQpZUWRsQ2ZSS0MrSkNyNFI3QkU4bUFOaHRrNzFON0RuS0I3Z0FraHVFbVR2cEpoSWJ3ekRhQVUyMmdXQU50c1JYCkVrR3lYVndXMlNPb0ZsTEp3SmROU0tGVk5ic2syYmNRNFRhV2V6ZU1oVG9KQmdsUk5ibEo3VWtqUjV2dzc5NnYKaWVtcW5ZM1I1QVNORzdZY0hQemIrWmVLWTVwMG4vcjdZUFZYZ3dJREFRQUJBb0lCQUFFcFhINnY2T2dyVkhqYQpxRE4vZ3pEdEtrS1Q0NUNJNkZEM0h1b1JYUVZuaE5HUE16b0x1dUZpd0s3eXB5dnJmOUJRL3BzaCtGaUlqRy8vCngvUjNUcmt0T0llSzU5bVUyaW96c0l5SVpXVUtXRlUweHk1ODdFWldsZkNYL2pvYUxWZndVZjl1YWxQeVNsT2UKeWt4WVdhSVpMSWpUTEpzek55ajAyMjFhT2hld0ZNYVVSMGk4Wk0ycWNLaHVGSFlNakVlRGlnK0luYjJ1M3BlZAo0NWVlL0NDd2V5UEZ3eVpNUjJhejJBWEZUYkNqcElSNWtjTmRkbnRVQnNaN05abFpwU0FXOUsxWmlsb25kZDcwCmxxbGdFeXJyZURUYXFoK2dKdWM5ZkxyYjYrUU9BbnF3STd2ai9ESzNHUVdsaGhmc0FuR1F4ODV3Vkp1YTBqcUQKNWhyR1ZBRUNnWUVBK0grOUVMSFlEZTZhckFaYnZNMzNNRHVpeHNoTDNqdGRLMEozaHpSMkROQTFLRmdvaml1UQovS1RRUlRiZ0pUSy9pODFKYjMvTmEzN3ZQL3IxMFBtQ0V5VTVzZ3RHQlZVV09ZRDd1ZnhGV09VREdvUWVHOVdHCjJRZkpJTkhOd0FaRHYyTjF4TXh1dEd6aUhISFM5OG1IY3NUcXhEL1MwUzVWcklObXovK3BxS01DZ1lFQTROYU8Ka1hqUTJrcmd1Qms5cGhSN0pKTEp2NXVUUWVvaEc0M1BLLzM5Y0hrN241ZFFDVkhTcWRrUFVLdUNnNDBQemlmeQp6YU4yY2J6Z3VnU21KZmZLeVV3S1FTNDVlY290SHdFenNhTHZGS0x5dk93Mmd2NnhXT3ROaWxJeVV0VVdWWENuCkk2d1NZZ0dndnVHbGNaNGt0SVN0Uk93cDA2MTNzV2Z2VDVVOEk2RUNnWUI5MUNqSEtGYVBqMjl3aGZPejRkTTEKOEN5WFhWclZWOWZ3ak1KN2l2dnZ0d29EdU1nb1hUVVlTTmhSQTkxeDJJV1hZOGE0bDgxTGprWFZidDFFQ09OdAprRjdyb2J1OS9YeTRkM0IvbDVjQjBVekdBM28vZTlyQlVLanVYbTVCdXFwWllpS0RHVVZCUlJVbGRCbHdjUEtPCkVkb1NyNEt2ZXpmVWwrRGFsOG12NHdLQmdBYjEvWkg1YUpYcGpZMkZrb2dLeUVrNGxqQnRjNkN0eS9xYmFGZVgKVkhwZjluMlpaS3YxTVkxNm4rUENlNWJ4RGhVMjNXaUtjQWRUYnEyenFTVXh4OEIxcnplWFk4WW1nVUVkZTJrNwpmeVZuYWhaNVJiTEdpZDBUNCtHdGE4dHV0M05MdXBEN0tkS0k5RjRVaEZmQktxZkFGOUV6Y3BRUUljMkhSenh5CmhWc2hBb0dBYlRoZG1pNGdzVk5vZHU2VHgwempRVkF1NHVRQmNUZjVOYVJnVm5rL3AvZlJPV2g3QkltdEQxcGkKa29GRTNrTHN3aWhBZzhEU2VsbS9QOGZFR0VaRHhXNDF6aURlTk1uRWV2U2FpYVBpcTBHTXJJb0RVRFZteXRNKwpoZGhrbFpqblBnVkl5M01HZURyUXE1MU12NmY0N2hITzRkS2JyTUsrTWlNUGhUVFA2MDA9Ci0tLS0tRU5EIFJTQSBQUklWQVRFIEtFWS0tLS0tCg=="
              - cluster_ca_certificate    = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMRENDQXBTZ0F3SUJBZ0lRUWJldUxJWWtwdUo4cGNUQkRmTWcvakFOQmdrcWhraUc5dzBCQVFzRkFEQXYKTVMwd0t3WURWUVFERXlRNU9HWXdOamxpWXkxa05qUTRMVFJsT0RNdFlqazJaQzFoTmpVd1pUUTFabU5sWVdVdwpJQmNOTWpJd01qQTJNRGt4TXpRd1doZ1BNakExTWpBeE16QXhNREV6TkRCYU1DOHhMVEFyQmdOVkJBTVRKRGs0ClpqQTJPV0pqTFdRMk5EZ3ROR1U0TXkxaU9UWmtMV0UyTlRCbE5EVm1ZMlZoWlRDQ0FhSXdEUVlKS29aSWh2Y04KQVFFQkJRQURnZ0dQQURDQ0FZb0NnZ0dCQU1Yb0NneXgxbVV5aGRlNzNQOW53cithaTYyWnY5OXE3c3E0Wm5RegpNMXhhS21GbDY2Tml5TVlBMkd3bmR5TXRKenZ2ZnExanZnTVZlamIyTG9rVWVYWHhhTG5nVUdEQndPRXF0SGFaCmRuRElVMFk3TjRyTUsrZGN3UU9FWnRCcVQxYjlTUVV3MlBTRGFldFNLSWRWWDFYS0JQZXp6MklESEZwODU1eUcKaVVDVGpjWnBVTmNITzd0ZEczaVRabGhFTTFUVW9qc25kQ1JKaW80aHBqOVF4Tmh1MGtqSmdFRmlSd1kvNVRRcwoxbHFlNTlmb3Vpc3hkcEovK1hmUUtjQ2s3c2kyVjlaenFXMUI0NHo0V0hjcFhzbmtMOUZZbWpIaEhOOFlFVVRzCi9iS21VODRBTXFQakhmNy9LcDZuZkE2bDdQTnRXeTJuQmVaK2dadkI3YStBbGlZbThBZU1yQnpNcWRSMldsYWEKcVlvUnV6WDgxc0d1TFl6NHRnRHJLSmtqUHY3SUVRM01iaXFzQndEQW44SDBpRTMzdXF3KzVRRTdLb2tLVldRUApkNklkaVNBMUlTTTUwZm9nZ2RqdytieCtGdGhDQkphOVNuRWlmN2ZzWjBzaGZXZHZsem13U1ByZGhqdElEdndtClZKN3ZoTFJVeFh6TDFMcmlUK3NGNjhOTFZRSURBUUFCbzBJd1FEQU9CZ05WSFE4QkFmOEVCQU1DQWdRd0R3WUQKVlIwVEFRSC9CQVV3QXdFQi96QWRCZ05WSFE0RUZnUVVwNGp1WW0zdWc4VEJacHdUVW1mdU00SGRpMWt3RFFZSgpLb1pJaHZjTkFRRUxCUUFEZ2dHQkFDN1Y2UHdKWmpoT2ptc1hiTEhRQjR5RE1VZ3E0UThSYjg0ZGI0VEYvbDB2CkMyanZFTDAvQ05rTTVsS0ZJcVU3Z0NILzBRQ21HTE5LQm5VVGZDZzJ6ejBqd0lBZ0JRT0JhWEJYSVNYby9KRGoKTDRCRTU3ZGJmRk9kTmhUNXNwSWFka3VhaEprenJqRGk2RDVXRFBEQVJTcDN1VXdhdDVMRDFRbThCMzZwVHJKaQpBblNLUWZmMWEyOVlUZUNvRlQzQ3QvOElYSEFtQXQyOGFFWmQ3NVBiTld2MlV4aTZWWkJsbnJyQjJ1L3d2M2x4CnFBV0dsWXRjSk15cVhua3d6bFR0VkptWExIMUNJS1g2YnZIWk5vK05TeEhoK1U1ODZNdzM1RmZZdmFsS0haRTIKNkltWTB0YmdvejJpY3ZLOFVyZUJRbEdxMURiZE1QY2NNeG5sMHpuOUovUCtva1VDTmJMRFdlYWtKVEhuSTUxRQpFQUFNVStMWHFmOEo2eHNBYVlPMlBFeUpoZG5XNFNiK1o2Rmlvd3JUakw5cGlzREU2Vk5lSFErNFlqVWs2eVF6ClpMTTFzQktjdnQrUVRrL1I4dGJJSWx0aHUybS94cTlzeVdBdTg0NDVtRmlGOHhZci9zVVRCVWs5amMxUkw4ZDQKKzdMSThXdWllZllGRnpmb1FvWkMydz09Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K"
            },
        ] -> (known after apply)
      ~ master_authorized_networks_config = [
          - {
              - cidr_blocks = [
                  - {
                      - cidr_block   = "0.0.0.0/0"
                      - display_name = ""
                    },
                ]
            },
        ] -> (known after apply)
      ~ master_version                    = "1.22.4-gke.1501" -> (known after apply)
      + min_master_version                = (known after apply)
      ~ monitoring_config                 = [
          - {
              - enable_components = [
                  - "SYSTEM_COMPONENTS",
                ]
            },
        ] -> (known after apply)
      ~ monitoring_service                = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                              = "gke-ce0faa8f"
      ~ network                           = "projects/test-terraform-project-01/global/networks/vpc" -> (known after apply)
      ~ network_policy                    = [
          - {
              - enabled  = true
              - provider = ""
            },
        ] -> (known after apply)
      ~ networking_mode                   = "VPC_NATIVE" -> (known after apply)
      ~ node_config                       = [
          - {
              - boot_disk_kms_key        = ""
              - disk_size_gb             = 100
              - disk_type                = "pd-standard"
              - ephemeral_storage_config = []
              - gcfs_config              = []
              - guest_accelerator        = []
              - image_type               = "COS_CONTAINERD"
              - kubelet_config           = []
              - labels                   = {}
              - linux_node_config        = []
              - local_ssd_count          = 0
              - machine_type             = "e2-standard-4"
              - metadata                 = {
                  - "disable-legacy-endpoints" = "true"
                }
              - min_cpu_platform         = ""
              - node_group               = ""
              - oauth_scopes             = [
                  - "https://www.googleapis.com/auth/cloud-platform",
                ]
              - preemptible              = false
              - sandbox_config           = []
              - service_account          = "gke-ce0faa8f-sa@test-terraform-project-01.iam.gserviceaccount.com"
              - shielded_instance_config = [
                  - {
                      - enable_integrity_monitoring = true
                      - enable_secure_boot          = true
                    },
                ]
              - spot                     = false
              - tags                     = []
              - taint                    = []
              - workload_metadata_config = [
                  - {
                      - mode = "GKE_METADATA"
                    },
                ]
            },
        ] -> (known after apply)
      ~ node_locations                    = [
          - "asia-southeast2-a",
          - "asia-southeast2-b",
          - "asia-southeast2-c",
        ] -> (known after apply)
      ~ node_pool                         = [
          - {
              - autoscaling                 = [
                  - {
                      - max_node_count = 9
                      - min_node_count = 3
                    },
                ]
              - initial_node_count          = 3
              - instance_group_urls         = [
                  - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-a/instanceGroupManagers/gke-gke-ce0faa8f-primary-86544329-grp",
                  - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-b/instanceGroupManagers/gke-gke-ce0faa8f-primary-12ef82d2-grp",
                  - "https://www.googleapis.com/compute/v1/projects/test-terraform-project-01/zones/asia-southeast2-c/instanceGroupManagers/gke-gke-ce0faa8f-primary-0d855080-grp",
                ]
              - managed_instance_group_urls = [
                  - "https://www.googleapis.com/compute/beta/projects/test-terraform-project-01/zones/asia-southeast2-a/instanceGroups/gke-gke-ce0faa8f-primary-86544329-grp",
                  - "https://www.googleapis.com/compute/beta/projects/test-terraform-project-01/zones/asia-southeast2-b/instanceGroups/gke-gke-ce0faa8f-primary-12ef82d2-grp",
                  - "https://www.googleapis.com/compute/beta/projects/test-terraform-project-01/zones/asia-southeast2-c/instanceGroups/gke-gke-ce0faa8f-primary-0d855080-grp",
                ]
              - management                  = [
                  - {
                      - auto_repair  = true
                      - auto_upgrade = true
                    },
                ]
              - max_pods_per_node           = 110
              - name                        = "primary"
              - name_prefix                 = ""
              - network_config              = [
                  - {
                      - create_pod_range    = false
                      - pod_ipv4_cidr_block = "10.20.0.0/16"
                      - pod_range           = "honestcard-compute-pods-subnet"
                    },
                ]
              - node_config                 = [
                  - {
                      - boot_disk_kms_key        = ""
                      - disk_size_gb             = 100
                      - disk_type                = "pd-standard"
                      - ephemeral_storage_config = []
                      - gcfs_config              = []
                      - guest_accelerator        = []
                      - image_type               = "COS_CONTAINERD"
                      - kubelet_config           = []
                      - labels                   = {}
                      - linux_node_config        = []
                      - local_ssd_count          = 0
                      - machine_type             = "e2-standard-4"
                      - metadata                 = {
                          - "disable-legacy-endpoints" = "true"
                        }
                      - min_cpu_platform         = ""
                      - node_group               = ""
                      - oauth_scopes             = [
                          - "https://www.googleapis.com/auth/cloud-platform",
                        ]
                      - preemptible              = false
                      - sandbox_config           = []
                      - service_account          = "gke-ce0faa8f-sa@test-terraform-project-01.iam.gserviceaccount.com"
                      - shielded_instance_config = [
                          - {
                              - enable_integrity_monitoring = true
                              - enable_secure_boot          = true
                            },
                        ]
                      - spot                     = false
                      - tags                     = []
                      - taint                    = []
                      - workload_metadata_config = [
                          - {
                              - mode = "GKE_METADATA"
                            },
                        ]
                    },
                ]
              - node_count                  = 3
              - node_locations              = [
                  - "asia-southeast2-a",
                  - "asia-southeast2-b",
                  - "asia-southeast2-c",
                ]
              - upgrade_settings            = [
                  - {
                      - max_surge       = 1
                      - max_unavailable = 0
                    },
                ]
              - version                     = "1.22.4-gke.1501"
            },
        ] -> (known after apply)
      ~ node_version                      = "1.22.4-gke.1501" -> (known after apply)
      ~ notification_config               = [
          - {
              - pubsub = [
                  - {
                      - enabled = false
                      - topic   = ""
                    },
                ]
            },
        ] -> (known after apply)
      + operation                         = (known after apply)
      ~ pod_security_policy_config        = [
          - {
              - enabled = false
            },
        ] -> (known after apply)
      ~ private_cluster_config            = [
          - {
              - enable_private_endpoint     = false
              - enable_private_nodes        = true
              - master_global_access_config = [
                  - {
                      - enabled = false
                    },
                ]
              - master_ipv4_cidr_block      = "10.40.0.0/28"
              - peering_name                = "gke-n3adcc4fa55f7e7dc3c2-fa5a-c60d-peer"
              - private_endpoint            = "10.40.0.2"
              - public_endpoint             = "34.101.66.208"
            },
        ] -> (known after apply)
      + private_ipv6_google_access        = (known after apply)
      - project                           = "test-terraform-project-01" -> null
      ~ release_channel                   = [
          - {
              - channel = "RAPID"
            },
        ] -> (known after apply)
      + remove_default_node_pool          = (known after apply)
      ~ resource_labels                   = {
          - "terraform" = "true"
        } -> (known after apply)
      ~ resource_usage_export_config      = [] -> (known after apply)
      ~ self_link                         = "https://container.googleapis.com/v1beta1/projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-ce0faa8f" -> (known after apply)
      ~ services_ipv4_cidr                = "10.30.0.0/16" -> (known after apply)
      ~ subnetwork                        = "projects/test-terraform-project-01/regions/asia-southeast2/subnetworks/honestcard-compute-primary-subnet" -> (known after apply)
      + tpu_ipv4_cidr_block               = (known after apply)
      ~ vertical_pod_autoscaling          = [] -> (known after apply)
      ~ workload_identity_config          = [
          - {
              - workload_pool = "test-terraform-project-01.svc.id.goog"
            },
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.gke.google_container_cluster.primary will be updated in-place
  ~ resource "google_container_cluster" "primary" {
        id                          = "projects/test-terraform-project-01/locations/asia-southeast2/clusters/gke-ce0faa8f"
        name                        = "gke-ce0faa8f"
        # (28 unchanged attributes hidden)










      ~ master_authorized_networks_config {
          - cidr_blocks {
              - cidr_block = "0.0.0.0/0" -> null
            }
          + cidr_blocks {
              + cidr_block = "10.40.0.0/28"
            }
        }









        # (18 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  # Warning: this attribute value will be marked as sensitive and will not
  # display in UI output after applying this change.
  ~ client_token = (sensitive value)

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 4 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @jai, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform GitHub Actions`*